In [25]:
import pandas as pd

people = {
    "first" : ["Corey", "Jane", "John"],
    "last" : ["Schafer", "Doe", "Doe"],
    "email" : ["Corey@gmail.com", "Jane@email.com", "Josn@email.com"]
}

df = pd.DataFrame(people)

df

   first     last            email
0  Corey  Schafer  Corey@gmail.com
1   Jane      Doe   Jane@email.com
2   John      Doe   Josn@email.com

In [26]:
df['full_name'] = df['first'] + ' ' + df['last']

In [27]:
df

   first     last            email      full_name
0  Corey  Schafer  Corey@gmail.com  Corey Schafer
1   Jane      Doe   Jane@email.com       Jane Doe
2   John      Doe   Josn@email.com       John Doe

In [28]:
df.drop(columns=['first', 'last'])

             email      full_name
0  Corey@gmail.com  Corey Schafer
1   Jane@email.com       Jane Doe
2   Josn@email.com       John Doe

In [29]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [30]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

   first     last            email      full_name
0  Corey  Schafer  Corey@gmail.com  Corey Schafer
1   Jane      Doe   Jane@email.com       Jane Doe
2   John      Doe   Josn@email.com       John Doe

In [31]:
df.append({'first': 'Tony'}, ignore_index=True)

/tmp/ipykernel_27010/67547244.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index=True)

   first     last            email      full_name
0  Corey  Schafer  Corey@gmail.com  Corey Schafer
1   Jane      Doe   Jane@email.com       Jane Doe
2   John      Doe   Josn@email.com       John Doe
3   Tony      NaN              NaN            NaN

In [32]:
people2 = {
    "first" : ["Tony", "Steve"],
    "last" : ["Stark", "Rogers"],
    "email" : ["Stark@gmail.com", "Rogers@email.com"]
}

df2 = pd.DataFrame(people2)

df2

   first    last             email
0   Tony   Stark   Stark@gmail.com
1  Steve  Rogers  Rogers@email.com

In [33]:
df.append(df2, ignore_index=True, sort=False)

/tmp/ipykernel_27010/2503217469.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

   first     last             email      full_name
0  Corey  Schafer   Corey@gmail.com  Corey Schafer
1   Jane      Doe    Jane@email.com       Jane Doe
2   John      Doe    Josn@email.com       John Doe
3   Tony    Stark   Stark@gmail.com            NaN
4  Steve   Rogers  Rogers@email.com            NaN

In [39]:
# df.drop(index=4)
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

   first     last            email      full_name
0  Corey  Schafer  Corey@gmail.com  Corey Schafer